app/controllers/habits_controller.rb

  def show
    @habit = Habit.find(params[:id])
---
SELECT  "habits".* FROM "habits" WHERE "habits"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]